IdeaRS.OpenModel.Concrete.DeflectionRequirementEc2
deflection calculation requirements

IdeaRS.OpenModel.Concrete.DeflectionRequirementEc2.Normal
The appearance and general utility of the structure could be impaired when the calculated
sag of a beam, slab or cantilever subjected to quasi-permanent loads exceeds span/250.

IdeaRS.OpenModel.Concrete.DeflectionRequirementEc2.Advanced
Deflections that could damage adjacent parts of the structure should be limited.